; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph6 - mode
	infrared5 - mode
	spectrograph4 - mode
	spectrograph2 - mode
	infrared1 - mode
	thermograph3 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation5 - direction
	Star7 - direction
	Star8 - direction
	Star3 - direction
	Star6 - direction
	GroundStation4 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared5)
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph6)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
)
(:goal (and
	(have_image Phenomenon9 spectrograph2)
	(have_image Phenomenon9 infrared5)
	(have_image Star10 thermograph3)
	(have_image Star10 thermograph0)
	(have_image Planet11 thermograph0)
	(have_image Planet11 infrared5)
	(have_image Star12 infrared1)
	(have_image Planet13 thermograph0)
	(have_image Planet13 infrared1)
	(have_image Phenomenon14 thermograph6)
))

)

; plan
1. (turn_to satellite0 groundstation4 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 planet13 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet13)
   goals met: 0 of 10
5. (take_image satellite0 planet13 instrument0 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 1 of 10
6. (take_image satellite0 planet13 instrument0 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 2 of 10
7. (turn_to satellite0 planet11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet11)
   goals met: 2 of 10
8. (take_image satellite0 planet11 instrument0 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 3 of 10
9. (take_image satellite0 planet11 instrument0 infrared5)
   added: (have_image planet11 infrared5)
   goals met: 4 of 10
10. (turn_to satellite0 phenomenon9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 10
11. (take_image satellite0 phenomenon9 instrument0 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 5 of 10
12. (take_image satellite0 phenomenon9 instrument0 infrared5)
   added: (have_image phenomenon9 infrared5)
   goals met: 6 of 10
13. (turn_to satellite0 phenomenon14 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon14)
   goals met: 6 of 10
14. (take_image satellite0 phenomenon14 instrument0 thermograph6)
   added: (have_image phenomenon14 thermograph6)
   goals met: 7 of 10
15. (turn_to satellite0 star10 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star10)
   goals met: 7 of 10
16. (take_image satellite0 star10 instrument0 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 8 of 10
17. (take_image satellite0 star10 instrument0 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 9 of 10
18. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 9 of 10
19. (take_image satellite0 star12 instrument0 infrared1)
   added: (have_image star12 infrared1)
   goals met: 10 of 10
